{
  "profile": {
    "name": "Rich Knowles",
    "title": "Innovation Leader | Systems Architect | Marine Corps Veteran",
    "location": "Elgin, IL 60123",
    "phone": "847-892-6123",
    "email": "richard@ajricardo.com",
    "linkedin": "https://linkedin.com/in/richknowlestech",
    "github": "https://github.com/richknowles",
    "website": "resume.richknowles.com",
    "picture": "/portrait.png"
  },
  "summary": "Senior Systems Administrator and Innovation Leader with 25+ years revolutionizing enterprise IT infrastructure. Pioneered Motorola's industry-first Certified Factory Image (CFI) program and led global engineering standards adopted across 7 business units worldwide. Architect of production-scale applications including a 2.2M-line WhatsApp messaging platform and the world's first custom MCP server for Linux AI integration. Deep expertise in validated systems, compliance-driven environments, disaster recovery planning, and modern full-stack development. Marine Corps veteran eligible for security clearance. Passionate about building innovative solutions that solve impossible problems.\n\nI'm not your typical IT guy. I toured with Slaughter, mixed my own album on Logic Pro X, and approach every project like a rock show—it has to be flawless, on time, and leave everyone wanting more.",
  "coreCompetencies": {
    "leadership": "Global Standards Development | Industry-First Solutions | Cross-Functional Team Leadership | Strategic Planning",
    "enterprise": "System Administration & Configuration | Change Control & Validation | User Access Management | GxP-Ready Documentation | Audit Support & Compliance | Disaster Recovery Planning",
    "development": "Full-Stack Development | AI/LLM Integration | Cloud Architecture (AWS/Azure/GCP) | Infrastructure as Code | DevOps | CI/CD",
    "technical": "Languages: Python | Rust | JavaScript/TypeScript | Shell Scripting | SQL | VBScript\nInfrastructure: VMware | Proxmox | Docker | Active Directory | Linux | Windows Server\nDatabases: SQL Server | MySQL | Database Migration & Integration\nCloud: AWS | Azure | GCP | Cloudflare | Linode\nSecurity: SentinelONE | Compliance | Threat Mitigation | Vulnerability Assessment\nTools: Git | Terraform | Ansible | Veeam | Logic Pro X"
  },
  "experience": [
    {
      "company": "iTWerks",
      "location": "Elgin, IL",
      "title": "Sr. System Administrator & Infrastructure Lead",
      "startDate": "2013-04",
      "endDate": "Present",
      "description": "Administer enterprise systems for 40+ small business clients, managing user provisioning, role assignments, permission management, and maintaining meticulous documentation of all configuration changes and system modifications.",
      "sections": {
        "softwareDevelopment": {
          "title": "Software Development & Innovation:",
          "bullets": [
            "Architected AJ Sender: Professional WhatsApp bulk messaging platform with 2.2 MILLION LINES OF CODE - Production-ready full-stack application: React, TypeScript, Node.js, Docker deployment - Features: CSV contact upload, campaign management dashboard, real-time analytics, dark/light mode UI - SSL support, automated monitoring, scheduled backups, security (CORS, rate limiting) - One-command installation with automated system optimization scripts - Demonstrates modern development practices and production deployment expertise",
            "Built Peacock: World's first custom Model Context Protocol (MCP) server for Claude Desktop on Linux - Revolutionary AI/system integration providing filesystem access, command execution, directory browsing - Python async programming with security-conscious design (home directory restriction, 30-second timeouts) - Enables context-aware AI assistance with granular, controlled system access - Industry innovation - pioneered custom MCP server development",
            "Developing Pluck: Wayland-native clipboard intelligence tool in Rust - Modern architecture with workspace crates (CLI, daemon, GUI, shared components) - Context-aware paste intelligence with cloud sync via rclone - GTK4 GUI for native Wayland experience - Demonstrates active skill development in cutting-edge systems programming",
            "Produced complete music album in Logic Pro X - Solo composition, mixing, and mastering published on SoundCloud - Professional-grade audio engineering demonstrating technical depth and creative problem-solving - Contacted by music producer—demonstrates quality and commercial viability - Proves complex software mastery and project completion capability"
          ]
        },
        "systemsAdmin": {
          "title": "Systems Administration & Infrastructure:",
          "bullets": [
            "Supported client audits by providing system evidence, access reports, change history, and compliance documentation—critical skills for GxP-regulated environments",
            "Implemented and maintained change control procedures ensuring all system modifications are documented, tested, and approved before deployment",
            "Designed and deployed validated system images, custom Active Directory schemas, and automated provisioning workflows",
            "Built custom Tactical RMM platform (POTA4 - Django/Vue/Go stack) for real-time server/workstation monitoring, automated patching, and proactive alerts",
            "Performed SQL Server administration including database migrations during M&A activity, integrating acquired firm data into parent environments and resolving access, policy, and identity conflicts",
            "Managed Microsoft 365 environments, DNS infrastructure (Cloudflare, MXToolBox, Google Workspace), certificate authorities, and backup/disaster recovery systems using Veeam",
            "Deployed and maintained multi-layered security with SentinelONE, multi-WAN failover firewalls (Cisco, SonicWall, Barracuda), and Ubiquiti UniFi WiFi with AWS EC2 controllers",
            "Provided 24/7 on-call support, incident response, and root cause analysis for critical system issues",
            "Performed server sales and licensing as Dell Reseller and Microsoft Partner; designed RAID configurations and storage pools based on capacity planning",
            "Delivered 99.9% uptime across 40+ client environments over 11+ years"
          ]
        }
      }
    },
    {
      "company": "Structured Communications, Inc. & Anstar Corporation",
      "location": "Illinois",
      "title": "Project Manager",
      "startDate": "2007-01",
      "endDate": "2013-04",
      "description": "Led enterprise infrastructure deployments and datacenter migrations for healthcare, financial, and union facilities.",
      "bullets": [
        "Delivered $30M Central DuPage Hospital infrastructure rollout under budget and ahead of schedule, managing system validation, regulatory requirements, and cross-functional coordination with IT, Operations, and Quality teams",
        "Decommissioned 560+ legacy servers for NYSE datacenter migration with zero downtime through phased validation, controlled transitions, and meticulous documentation",
        "Managed system documentation, change requests, and stakeholder communications across multiple business units",
        "Served as project manager for complete infrastructure buildout at IUOE Local 150's Chicago headquarters on the river—delivered firewall setup, LAN/WAN design, VoIP integration, and Cisco network/robotics deployments",
        "Led Structured Communications' initial network engineering team as project manager for new Chicagoland market expansion",
        "Coordinated client briefings and sales-engineering collaboration; successful contract completion led to establishment of Warrenville, IL division"
      ]
    },
    {
      "company": "Motorola Solutions",
      "location": "Schaumburg, IL",
      "title": "Team Lead | Systems Architect | Asset Manager | Global Standards Chair",
      "startDate": "1997-01",
      "endDate": "2006-06",
      "sections": {
        "cfi": {
          "title": "PIONEERED CERTIFIED FACTORY IMAGE (CFI) PROGRAM — INDUSTRY FIRST",
          "bullets": [
            "Founded and led Motorola's Desktop Architecture team, creating the world's FIRST Certified Factory Image (CFI) program",
            "Revolutionized enterprise deployment by partnering with Dell, HP, and Lenovo to pre-install Motorola's validated system images at the factory before shipping",
            "Eliminated the operational bottleneck of manually imaging thousands of machines after delivery",
            "Saved millions in labor costs and deployment time across global operations",
            "Developed comprehensive validation documentation, testing protocols, and change control procedures for factory-installed images",
            "Created and maintained system configuration specifications, metadata, and deployment documentation for global rollouts",
            "This innovation became industry standard practice and is now used by enterprises worldwide"
          ]
        },
        "standards": {
          "title": "GLOBAL ENGINEERING STANDARDS LEADERSHIP",
          "bullets": [
            "Chaired the GLOBAL HARDWARE STANDARDS COMMITTEE",
            "Established hardware/software requirements adopted across 7 business units worldwide",
            "Authored division-wide technical specifications and procurement standards",
            "Led hardware sourcing partnerships with Dell, HP, and IBM for engineering divisions",
            "Served as technical liaison between IT, vendors, and business units for system validation and compliance activities"
          ]
        },
        "dr": {
          "title": "DISASTER RECOVERY & COMPLIANCE",
          "bullets": [
            "Authored COMPLETE DISASTER RECOVERY PLAN for Motorola's WSDD division",
            "Created comprehensive DR documentation including recovery procedures, testing protocols, and validation processes",
            "Led disaster recovery planning and documentation across engineering divisions",
            "Maintained detailed audit trails for all hardware assets, leases, and system configurations"
          ]
        },
        "additional": {
          "title": "ADDITIONAL ACHIEVEMENTS",
          "bullets": [
            "Recovered $3M in duplicate charges through meticulous system audits, cross-referencing multiple databases, and line-by-line vendor contract review",
            "Recognized with maximum bonus, stock awards, and division-wide honors",
            "Managed user access, permissions, and role assignments for engineering divisions across multiple systems and applications",
            "Promoted to Team Lead after 6-month initial contract; later promoted to Asset Manager overseeing 3 storerooms and all tracked hardware across engineering labs",
            "First in program history to zero-out call queue through process optimization and efficiency improvements"
          ]
        }
      }
    }
  ],
  "education": [
    {
      "institution": "PortSwigger Web Security Academy",
      "location": "Remote",
      "degree": "BSCP in Cybersecurity: Web Application Security (Ongoing)",
      "startDate": "2025-07",
      "endDate": "Present"
    },
    {
      "institution": "College of DuPage",
      "location": "Glen Ellyn, IL",
      "degree": "Computer Science & Business",
      "startDate": "1992-09",
      "endDate": "1995-06"
    },
    {
      "institution": "United States Marine Corps",
      "location": "Millington, TN",
      "degree": "Aircraft Electronics (Avionics Technician)",
      "startDate": "1994-01",
      "endDate": "1995-01"
    }
  ],
  "military": {
    "branch": "United States Marine Corps",
    "rank": "Private First Class",
    "mos": "Avionics Technician (Aircraft Electronics)",
    "service": "April 1994 – January 1995",
    "clearance": "Eligible for reinstatement"
  },
  "highlights": {
    "innovation": [
      "Created industry-first CFI program now used by enterprises worldwide",
      "Built world's first custom MCP server for Linux AI integration",
      "Architected 2.2M-line production WhatsApp messaging platform",
      "Developing modern Rust-based clipboard manager (Pluck)"
    ],
    "leadership": [
      "Chaired global engineering standards committee (7 business units)",
      "Founded and led Motorola's Desktop Architecture team",
      "Created comprehensive disaster recovery plan for major division",
      "Led cross-functional teams across IT, Operations, and Quality"
    ],
    "financial": [
      "Saved millions through CFI program automation",
      "Recovered $3M in duplicate vendor charges",
      "Delivered $30M hospital infrastructure under budget",
      "Managed 560+ server decommissioning with zero downtime"
    ],
    "technical": [
      "25+ years enterprise systems administration",
      "Full-stack development (React/TypeScript/Node.js/Python/Rust)",
      "Modern DevOps practices (Docker, CI/CD, IaC)",
      "GxP-validated systems and compliance documentation",
      "2+ years intensive AI/LLM training and implementation"
    ],
    "creative": [
      "Produced complete album in Logic Pro X (composition, mixing, mastering)",
      "Contacted by music producer for commercial work",
      "\"First take is best take\" philosophy applied to technical work",
      "Renaissance technologist: code, music, systems, leadership"
    ]
  },
  "projects": [
    {
      "name": "AJ Sender",
      "description": "Professional WhatsApp bulk messaging platform (2.2M lines)",
      "tech": "Production-ready: React, TypeScript, Node.js, Docker | CSV upload, campaign management, real-time analytics"
    },
    {
      "name": "Peacock",
      "description": "World's first custom MCP server for Claude Desktop on Linux",
      "tech": "Python async | Filesystem access, command execution, secure system integration"
    },
    {
      "name": "Pluck",
      "description": "Wayland-native clipboard intelligence tool",
      "tech": "100% Rust | Context-aware paste, cloud sync, GTK4 GUI, daemon architecture"
    },
    {
      "name": "POTA4",
      "description": "Custom Tactical RMM fork",
      "tech": "Django/Vue/Go | Real-time monitoring, automated patching, proactive alerts"
    }
  ],
  "philosophy": "I don't just fix IT problems—I revolutionize how enterprises deploy technology.\n\nWhether you need someone to untangle 20 years of IT debt, architect a production-scale application from scratch, lead global standards adoption, or build something that's never existed before—I'm your guy.\n\nFirst take is usually the best take. Let's nail this.",
  "portfolio": {
    "website": "resume.richknowles.com",
    "business": "itwerks.net",
    "music": "soundcloud.com/rich-knowles-82881417"
  }
}
