{
  "profile": {
    "name": "Rich Knowles",
    "location": "Elgin, IL",
    "phone": "847-857-8813",
    "email": "rich@itwerks.net",
    "linkedin": "linkedin.com/in/richknowles",
    "github": "github.com/richknowles",
    "website": "resume.richknowles.com"
  },
  "summary": "Senior systems administrator and infrastructure architect with 25+ years of experience building, securing, and automating technical environments. Technical lead on large-scale data integrations, custom RMM platforms, SQL migrations, and system rollouts for small businesses and enterprise clients. Built and ran the first Desktop Architecture team at Motorola, leading factory image creation, lease management, and automation tooling. Known for direct, hands‑on work across server, storage, networking, and DNS layers with deep experience supporting mergers and multi‑office setups.",
  "coreCompetencies": [
    "Systems Architecture",
    "SQL Database Migrations",
    "Client Infrastructure Integration",
    "Server Sales & Licensing",
    "DNS/CloudFlare Setup & Recovery",
    "Backup & DR Planning",
    "Virtualization: VMware",
    "Storage & RAID Design",
    "Certificate Automation",
    "Cloud: AWS · Azure · GCP",
    "Scripting: Python · VBScript · Shell",
    "Microsoft 365 & Licensing"
  ],
  "experience": [
    {
      "company": "iTWerks",
      "location": "Elgin, IL",
      "title": "Sr. System Administrator & Product Lead",
      "startDate": "2013-04",
      "endDate": "Present",
      "bullets": [
        "Built a WhatsApp-based marketing campaign app from scratch using Python and JavaScript; packaged it for Windows deployment with a signed certificate.",
        "Built and sold custom RMM platform using open‑source tools, Python, and shell scripting for proactive server/workstation monitoring and automation.",
        "Migrated and merged SQL databases using SQL Server Management Studio, especially in support of accounting firm acquisitions.",
        "Acted as technical lead during M&A activity, integrating data from acquired firms into parent environments and resolving access, policy, and identity conflicts.",
        "Performed server sales, Microsoft 365 setup, and custom licensing for clients as a Dell Reseller and Microsoft Partner.",
        "Designed and upgraded RAID configurations and storage pools based on capacity planning needs.",
        "Built DNS records and managed routing across CloudFlare, MXToolBox, and Google Workspace for small businesses; wrote automated scripts for certificate renewals across VPS deployments.",
        "Deployed and supported SentinelONE, Veeam, VMware, and multi‑WAN firewalls (Cisco, SonicWall, Barracuda) across 40+ client environments."
      ]
    },
    {
      "company": "Structured Communications, Inc. & Anstar Corp.",
      "location": "IL",
      "title": "Project Manager",
      "startDate": "2007-01",
      "endDate": "2013-04",
      "bullets": [
        "Delivered a $30M infrastructure rollout at Central DuPage Hospital under budget and ahead of schedule.",
        "Decommissioned over 560 legacy servers for NYSE datacenter migration with zero downtime using phased transitions.",
        "Led Cisco network and robotics deployments at multiple client sites.",
        "Served as project manager for firewall setup, LAN/WAN design, and VoIP integration at IUOE Local 150’s newly constructed Chicago headquarters on the river—delivering a complete, secure infrastructure buildout for the crane operators’ union.",
        "Managed client coordination, briefings, and sales‑engineering collaboration across multiple business units."
      ]
    },
    {
      "company": "Motorola Inc.",
      "location": "Schaumburg, IL",
      "title": "Team Lead, Asset Manager, Systems Architect",
      "startDate": "1997-01",
      "endDate": "2006-06",
      "bullets": [
        "Joined Motorola full‑time after 6 months as a contractor. Promoted to team lead, then Asset Manager for engineering, overseeing 3 storerooms and all tracked hardware across engineering labs.",
        "Founded and led Motorola’s first Desktop Architecture team — responsible for custom Windows image development (CFI) for HP and Dell, built and deployed at the factory.",
        "Designed rollout processes for thousands of leased machines, including returns, imaging, and in‑house automation tools tailored per department.",
        "Recovered over $3M in duplicate lease and maintenance charges by auditing HP contracts line‑by‑line across multiple internal systems — recognized with max bonus, stock awards, and division‑wide honors.",
        "Served as technical point of contact for software loadout validation, hardware vendor negotiation, and division IT coordination."
      ]
    }
  ],
  "education": [
    {
      "institution": "PortSwigger Web Security Academy",
      "location": "Remote",
      "degree": "Ongoing",
      "startDate": "",
      "endDate": ""
    },
    {
      "institution": "College of DuPage",
      "location": "Glen Ellyn, IL",
      "degree": "Some College in Computer Science",
      "startDate": "",
      "endDate": ""
    },
    {
      "institution": "USMC",
      "location": "Millington, TN",
      "degree": "Vocational School in Aircraft Electronics",
      "startDate": "",
      "endDate": ""
    }
  ],
  "certifications": [],
  "technicalSkills": [
    "Linux",
    "VMware",
    "Veeam",
    "SentinelONE",
    "SQL Server",
    "Active Directory",
    "Docker",
    "LXC",
    "AWS",
    "Azure",
    "GCP",
    "CloudFlare",
    "Git",
    "Python",
    "Shell Scripting",
    "RAID",
    "DNS",
    "Cisco",
    "SonicWall",
    "Barracuda",
    "MySQL",
    "Microsoft 365",
    "Windows Server",
    "SSL/TLS Automation",
    "API Architecture"
  ],
}
