{
  "profile": {
    "name": "Rich Knowles",
    "location": "Elgin, IL",
    "phone": "847-892-6123",
    "email": "rich@itwerks.net",
    "linkedin": "https://linkedin.com/in/richknowles",
    "github": "https://github.com/richknowles",
    "website": "resume.richknowles.com",
    "picture": "/portrait.png"
  },
  "summary": "Senior Systems Administrator with 25+ years managing enterprise IT infrastructure, validated systems, and compliance-driven environments. Pioneered Motorola's first Certified Factory Image (CFI) program, revolutionizing global hardware deployment. Deep expertise in system administration, change control, user access management, and documentation for regulated environments. 2+ years of intensive AI/LLM training and implementation. Proven ability to maintain system integrity, support audits, and collaborate across technical and business teams.",
  "coreCompetencies": [
    "System Administration & Configuration",
    "Change Control & Validation",
    "User Access Management",
    "GxP-Ready Documentation",
    "Audit Support & Compliance",
    "SQL Database Administration",
    "Active Directory & User Provisioning",
    "Technical Troubleshooting",
    "Stakeholder Communication",
    "Metadata Management",
    "System Performance Monitoring",
    "IT Process Optimization",
    "AI/LLM Training & Implementation",
    "Infrastructure Automation (Terraform · Ansible)",
    "DevOps: GitHub · Cloudflare Pages · Static Site Deployment",
    "Virtualization: VMware · Proxmox · Citrix",
    "Cloud: AWS · Azure · GCP · Oracle Cloud",
    "Network Security & Threat Mitigation"
  ],
  "experience": [
    {
      "company": "iTWerks",
      "location": "Elgin, IL",
      "title": "Sr. System Administrator & Infrastructure Lead",
      "startDate": "2013-04",
      "endDate": "Present",
      "bullets": [
        "Administer enterprise systems including user provisioning, role assignments, permission management, and access control across 40+ client environments",
        "Maintain comprehensive documentation for all configuration changes, user management activities, and system modifications following strict change control procedures",
        "Support client audits by providing system evidence, access reports, change history, and compliance documentation",
        "Partner with business process owners to implement configuration updates, workflows, and system enhancements while maintaining operational stability",
        "Manage SQL Server databases including migrations, mergers, and integration during M&A activity for accounting firms",
        "Deploy and maintain validated monitoring systems (SentinelONE, Veeam) with full audit trails and compliance documentation",
        "Execute controlled changes to production systems following validation requirements including testing and approval workflows",
        "Design and implement custom Model Context Protocol (MCP) servers enabling secure AI integration with enterprise systems",
        "Architect and deploy full-stack mass-messaging campaign system (AJ Sender: 2.2M lines) with WhatsApp backend using Node.js, Selenium, React/TSX, Vite, and Python orchestration",
        "Use Terraform for infrastructure-as-code deployments, provisioning cloud instances, DNS records, and networking resources",
        "Build and deploy modern static sites using GitHub and Cloudflare Pages with automated CI/CD pipelines",
        "Train and implement AI/LLM systems for 2+ years, developing custom automation workflows and intelligent assistant capabilities"
      ]
    },
    {
      "company": "Structured Communications, Inc. & Anstar Corp.",
      "location": "IL",
      "title": "Project Manager",
      "startDate": "2007-01",
      "endDate": "2013-04",
      "bullets": [
        "Delivered $30M Central DuPage Hospital infrastructure rollout under budget and ahead of schedule, managing system validation and regulatory requirements",
        "Decommissioned 560+ legacy servers for NYSE datacenter migration with zero downtime through phased validation and controlled transitions",
        "Coordinated with IT, Operations, and Quality teams to ensure ongoing compliance with internal policies and external regulations",
        "Managed system documentation, change requests, and stakeholder communications across multiple business units"
      ]
    },
    {
      "company": "Motorola Solutions",
      "location": "Schaumburg, IL",
      "title": "Team Lead, Systems Architect, Asset Manager",
      "startDate": "1997-01",
      "endDate": "2006-06",
      "highlights": "PIONEERED CERTIFIED FACTORY IMAGE (CFI) PROGRAM - INDUSTRY FIRST",
      "bullets": [
        "Founded and led Motorola's Desktop Architecture team, creating the world's first Certified Factory Image (CFI) program",
        "Revolutionized enterprise deployment by partnering with Dell, HP, and Lenovo to pre-install Motorola's validated system images at the factory before shipping",
        "Eliminated the operational bottleneck of manually imaging thousands of machines after delivery, saving millions in labor costs and deployment time",
        "Developed comprehensive validation documentation, testing protocols, and change control procedures for factory-installed images",
        "Created and maintained system configuration specifications, metadata, and deployment documentation for global rollouts",
        "This innovation became industry standard practice and is now used by enterprises worldwide",
        "Managed user access, permissions, and role assignments for engineering divisions across multiple systems and applications",
        "Maintained detailed audit trails and documentation for all hardware assets, leases, and system configurations",
        "Recovered $3M in duplicate charges through meticulous system audits and cross-referencing multiple databases",
        "Served as technical liaison between IT, vendors, and business units for system validation and compliance activities"
      ]
    }
  ],
  "education": [
    {
      "institution": "PortSwigger Web Security Academy",
      "location": "Remote",
      "degree": "BSCP in Cybersecurity: Web Application Security (Ongoing)",
      "startDate": "2025-07",
      "endDate": ""
    },
    {
      "institution": "College of DuPage",
      "location": "Glen Ellyn, IL",
      "degree": "Computer Science",
      "startDate": "1992-01",
      "endDate": "1995-12"
    },
    {
      "institution": "USMC",
      "location": "Millington, TN",
      "degree": "Aircraft Electronics",
      "startDate": "1994-01",
      "endDate": "1995-01"
    }
  ],
  "technicalSkills": [
    "System Administration: Active Directory · User Management · Access Control · Change Management",
    "Compliance & Documentation: Audit Support · Validation · IQ/OQ/PQ · Change Control · SOPs",
    "Databases: SQL Server · MySQL · Database Administration · Migration · Integration",
    "Infrastructure: VMware · Windows Server · Linux · DNS · Certificate Management",
    "AI/LLM: 2+ Years Training & Implementation · Custom Automation · Intelligent Assistants · MCP Server Development",
    "DevOps: GitHub · Cloudflare Pages · CI/CD Pipelines · Static Site Generation",
    "Infrastructure Automation: Terraform · Ansible",
    "Cloud: AWS · Azure · GCP · Oracle Cloud",
    "Virtualization: VMware · Proxmox · Citrix · Docker · LXC",
    "Tools & Platforms: Microsoft 365 · Veeam · SentinelONE · CloudFlare · Python · Shell Scripting",
    "Network Security & Threat Mitigation",
    "Storage & RAID Design",
    "Backup & DR Planning"
  ],
  "military": {
    "branch": "United States Marine Corps",
    "rank": "Private First Class",
    "serviceDates": "1994-01 to 1995-01",
    "role": "Avionics Technician (Aircraft Electronics)"
  }
}
