{
  "profile": {
    "name": "Rich Knowles",
    "location": "Elgin, IL",
    "phone": "847-892-6123",
    "email": "rich@itwerks.net",
    "linkedin": "https://linkedin.com/in/richknowles",
    "github": "https://github.com/richknowles",
    "website": "resume.richknowles.com"
  },
  "summary": "Accomplished IT Systems Engineer with 15+ years of professional experience in both corporate and consulting roles. Expert in systems architecture, automation, secure remote access, and AI-powered development. Proven leader in project management and infrastructure modernization. Seeking fully remote opportunities to leverage deep technical expertise and drive innovation for forward-thinking organizations.",
  "coreCompetencies": [
    "Systems Architecture",
    "Infrastructure Automation (Terraform · Ansible)",
    "Virtualization: VMware · Proxmox · Citrix",
    "SQL Database Migrations",
    "Client Infrastructure Integration",
    "Server Sales & Licensing",
    "DNS/CloudFlare Setup & Recovery",
    "Backup & DR Planning",
    "Certificate Automation",
    "Cloud: AWS · Azure · GCP · Oracle Cloud",
    "Scripting: Python · PowerShell · Bash · VBScript · Shell",
    "Microsoft 365 & Licensing",
    "Remote Access & Secure Connectivity",
    "Network Security & Threat Mitigation"
  ],
  "experience": [
    {
      "company": "iTWerks",
      "location": "Elgin, IL",
      "title": "Senior IT Systems Engineer",
      "startDate": "2013-04",
      "endDate": "Present",
      "bullets": [
        "Architected and deployed full-stack mass-messaging campaign system (AJ Sender) with WhatsApp backend using Node.js, Selenium, React/TSX, Vite, and Python orchestration.",
        "Used Terraform for infrastructure-as-code deployments, provisioning cloud instances, DNS records, and networking resources.",
        "Expanded automation across OCI, Proxmox, and hybrid environments to improve operational efficiency.",
        "Built Terraform modules to automate infrastructure for Proxmox lab, Oracle Cloud (OCI), and internal DNS systems (Technitium, Cloudflare).",
        "Designed and built custom RMM solution using open-source tools, Python, and shell scripting for proactive monitoring and endpoint management.",
        "Led M&A tech integration, merging SQL databases, resolving policy/identity conflicts, and migrating acquired firm data into master environments.",
        "Deployed and managed VMware and Citrix environments for clients, including virtualization of Windows Server Domain Controllers, application servers, and Synology NAS storage.",
        "Built and managed split-horizon DNS infrastructure, reverse proxy systems (Caddy), and multi-WAN routing with CloudFlare, SonicWall, Cisco, and Barracuda appliances.",
        "Performed server sales, Microsoft 365 onboarding, and custom licensing as a Dell Reseller and Microsoft Partner.",
        "Planned and upgraded RAID and SAN configurations based on capacity forecasts, disaster recovery strategy, and performance targets.",
        "Deployed and supported enterprise tools including SentinelONE, Veeam, VMware, and secure remote access environments across 40+ clients."
      ]
    },
    {
      "company": "Structured Communications, Inc. & Anstar Corp.",
      "location": "IL",
      "title": "Project Manager",
      "startDate": "2007-01",
      "endDate": "2013-04",
      "bullets": [
        "Delivered a $30M infrastructure rollout at Central DuPage Hospital under budget and ahead of schedule.",
        "Decommissioned over 560 legacy servers for NYSE datacenter migration with zero downtime using phased transitions.",
        "Led Cisco network and robotics deployments at multiple client sites.",
        "Managed firewall setup, LAN/WAN design, and VoIP integration at IUOE Local 150’s Chicago headquarters, delivering a secure infrastructure build-out.",
        "Coordinated client briefings and sales-engineering collaboration across multiple business units."
      ]
    },
    {
      "company": "Motorola Solutions",
      "location": "Schaumburg, IL",
      "title": "Senior Systems Engineer IV",
      "startDate": "1997-01",
      "endDate": "2006-06",
      "bullets": [
        "Promoted to Senior Systems Engineer IV and Asset Manager, overseeing 3 storerooms and all tracked hardware across engineering labs.",
        "Founded and led Motorola’s first Desktop Architecture team, responsible for custom Windows image development for HP and Dell.",
        "Designed rollout processes for thousands of leased machines, including returns, imaging, and in-house automation tools.",
        "Recovered over $3M in duplicate lease and maintenance charges by auditing HP contracts, earning division-wide honors.",
        "Served as technical point of contact for software load-out validation, hardware vendor negotiation, and division IT coordination."
      ]
    }
  ],
  "education": [
    {
      "institution": "PortSwigger Web Security Academy",
      "location": "Remote",
      "degree": "BSCP in Cybersecurity: Web Application Security (Ongoing)",
      "startDate": "2025-07",
      "endDate": ""
    },
    {
      "institution": "College of DuPage",
      "location": "Glen Ellyn, IL",
      "degree": "Some College in Computer Science",
      "startDate": "1992-01",
      "endDate": "1995-12"
    },
    {
      "institution": "USMC",
      "location": "Millington, TN",
      "degree": "Avionics (Aircraft Electronics)",
      "startDate": "1994-04",
      "endDate": "1995-01"
    }
  ],
  "technicalSkills": [
    "Systems Architecture",
    "Infrastructure Automation: Terraform · Ansible",
    "Virtualization: VMware · Proxmox · Citrix",
    "SQL Server · MySQL",
    "Active Directory & Microsoft 365",
    "Docker · LXC",
    "Linux · UNIX · Windows Server · macOS",
    "Veeam",
    "SentinelONE",
    "Confluence · SharePoint",
    "Intune",
    "Caddy Reverse Proxy",
    "Cloud: AWS · Azure · GCP · Oracle Cloud",
    "CloudFlare DNS",
    "Shell Scripting · PowerShell · Python · VBScript · Bash",
    "Git",
    "Salesforce",
    "API Architecture",
    "Network Security & Threat Mitigation",
    "Storage & RAID Design",
    "Backup & DR Planning"
  ],
  "military": {
    "branch": "United States Marine Corps",
    "rank": "Private First Class",
    "serviceDates": "1994-01 to 1995-01",
    "role": "Avionics Technician (Aircraft Electronics)"
  }
}
